HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
    #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
        #warning "Consider enabling ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES for NetworkInterface"
    #endif

	/* TODO: There should be a universal check for use in network interfaces, similar to eConsiderFrameForProcessing.
	 * So, don't use this macro, and filter anyways in the mean time. */
	/* #if ipconfigIS_DISABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
			#warning "Consider enabling ipconfigETHERNET_DRIVER_FILTERS_PACKETS for NetworkInterface"
	#endif */

    #if ipconfigIS_DISABLED( ipconfigUSE_LINKED_RX_MESSAGES )
        #warning "Consider enabling ipconfigUSE_LINKED_RX_MESSAGES for NetworkInterface"
    #endif

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            Macros & Definitions                           */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#define niEMAC_MPU ( defined( __MPU_PRESENT ) && ( __MPU_PRESENT == 1U ) )
#if ( niEMAC_MPU != 0 )
    #define niEMAC_MPU_ENABLED      ( _FLD2VAL( MPU_CTRL_ENABLE, MPU->CTRL ) != 0 )
#endif

#define niEMAC_CACHEABLE ( defined( __DCACHE_PRESENT ) && ( __DCACHE_PRESENT == 1U ) )
#if ( niEMAC_CACHEABLE != 0 )
    #define niEMAC_CACHE_ENABLED    ( _FLD2VAL( SCB_CCR_DC, SCB->CCR ) != 0 )
    #define niEMAC_CACHE_MAINTENANCE ( niEMAC_CACHE_ENABLED && ipconfigIS_DISABLED( niEMAC_USE_MPU ) )
    #ifdef __SCB_DCACHE_LINE_SIZE
        #define niEMAC_DATA_ALIGNMENT    __SCB_DCACHE_LINE_SIZE
    #else
        #define niEMAC_DATA_ALIGNMENT    32U
    #endif
#else
    #define niEMAC_DATA_ALIGNMENT   4U
#endif

#define niEMAC_DATA_ALIGNMENT_MASK   ( niEMAC_DATA_ALIGNMENT - 1U )
#define niEMAC_BUF_ALIGNMENT        32U
#define niEMAC_BUF_ALIGNMENT_MASK   ( niEMAC_BUF_ALIGNMENT - 1U )

#define niEMAC_DATA_BUFFER_SIZE     ( ( ipTOTAL_ETHERNET_FRAME_SIZE + niEMAC_DATA_ALIGNMENT_MASK ) & ~niEMAC_DATA_ALIGNMENT_MASK )
#define niEMAC_TOTAL_BUFFER_SIZE    ( ( ( niEMAC_DATA_BUFFER_SIZE + ipBUFFER_PADDING ) + niEMAC_BUF_ALIGNMENT_MASK ) & ~niEMAC_BUF_ALIGNMENT_MASK )

#if defined( niEMAC_STM32FX )

	#ifdef ETH_GIANT_PACKET
		#undef ETH_GIANT_PACKET
	#endif
	#define ETH_GIANT_PACKET ETH_DMARXDESC_IPV4HCE

	#ifdef ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ETH_DMASR_RBUS

	#ifdef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ETH_DMASR_TBUS

	/* Note: ETH_CTRLPACKETS_BLOCK_ALL is incorrectly defined in HAL ETH Driver as of F7 V1.17.1 && F4 V1.28.0 */
	#ifdef ETH_CTRLPACKETS_BLOCK_ALL
		#undef ETH_CTRLPACKETS_BLOCK_ALL
	#endif
	#define ETH_CTRLPACKETS_BLOCK_ALL ETH_MACFFR_PCF_BlockAll

#elif defined( niEMAC_STM32HX )

	#ifdef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
		#undef ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG
	#endif
	#define ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ETH_DMACSR_TBU

	#define ETH_DMA_TX_ERRORS_MASK ETH_DMACSR_TEB
	#define ETH_DMA_RX_ERRORS_MASK ETH_DMACSR_REB

#endif

#define niEMAC_BUFS_PER_DESC 2U

/* IEEE 802.3 CRC32 polynomial - 0x04C11DB7 */
#define niEMAC_CRC_POLY 0x04C11DB7
#define niEMAC_MAC_IS_MULTICAST( MAC )  ( ( MAC[ 0 ] & 1U ) != 0 )
#define niEMAC_MAC_IS_UNICAST( MAC )    ( ( MAC[ 0 ] & 1U ) == 0 )
#define niEMAC_ADDRESS_HASH_BITS    64U
#define niEMAC_MAC_MATCH_COUNT  3U

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                               typedefs                                    */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Interrupt events to process: reception, transmission and error handling. */
typedef enum {
    eMacEventNone = 0,
    eMacEventRx = 1 << 0,
    eMacEventTx = 1 << 1,
    eMacEventErrRx = 1 << 2,
    eMacEventErrTx = 1 << 3,
    eMacEventErrDma = 1 << 4,
    eMacEventErrEth = 1 << 5,
    eMacEventErrMac = 1 << 6,
    eMacEventAll = ( 1 << 7 ) - 1,
} eMAC_IF_EVENT;

typedef enum
{
    eMacEthInit, /* Must initialise ETH. */
    eMacPhyInit, /* Must initialise PHY. */
    eMacPhyStart, /* Must start PHY. */
    eMacTaskStart, /* Must start deferred interrupt handler task. */
    eMacEthStart, /* Must start ETH. */
    eMacInitComplete /* Initialisation was successful. */
} eMAC_INIT_STATUS_TYPE;

/* typedef struct xPhyData
{
    EthernetPhy_t xPhyObject;
    #if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_PHY_INT )
		union {
			lan8742_Object_t xLan8742a;
			dp83848_Object_t xDp83848;
		} xPhyInstance;
	#endif
} PhyData_t;

typedef struct xMacSrcMatchData
{
    uint8_t ucSrcMatchCounters[ niEMAC_MAC_MATCH_COUNT ];
    uint8_t uxMACEntryIndex = 0;
} MacSrcMatchData_t;

typedef struct xMacHashData
{
    uint32_t ulHashTable[ niEMAC_ADDRESS_HASH_BITS / 32 ];
    uint8_t ucAddrHashCounters[ niEMAC_ADDRESS_HASH_BITS ];
} MacHashData_t;

typedef struct xMacFilteringData
{
    MacSrcMatchData_t xSrcMatch;
    MacHashData_t xHash;
} MacFilteringData_t;

typedef struct xEMACData
{
    ETH_HandleTypeDef xEthHandle;
    ETH_DMADescTypeDef xDMADescTx[ ETH_TX_DESC_CNT ];
    ETH_DMADescTypeDef xDMADescRx[ ETH_RX_DESC_CNT ];
    EthernetPhy_t xPhyObject;
    TaskHandle_t xEMACTaskHandle;
    SemaphoreHandle_t xTxMutex, xTxDescSem;
    ETH_BufferTypeDef xTxBuffers[ niEMAC_BUFS_PER_DESC * ETH_TX_DESC_CNT ];
    BaseType_t xSwitchRequired;
    eMAC_INIT_STATUS_TYPE xMacInitStatus;
    BaseType_t xEMACIndex;
    MacFilteringData_t xMacFilteringData;
} EMACData_t; */

/* TODO: need a data structure to assist in adding/removing allowed addresses */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Static Function Declarations                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

/* Phy Hooks */
static BaseType_t prvPhyReadReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t * pulValue );
static BaseType_t prvPhyWriteReg( BaseType_t xAddress, BaseType_t xRegister, uint32_t ulValue );

