HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
        if( HAL_ETH_Init( pxEthHandle ) == HAL_OK )
        {
            uint32_t ulReg = READ_REG( pxEthHandle->Instance->MACCR );
            #ifdef niEMAC_STM32FX
                #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
                    SET_BIT( ulReg, ETH_MACCR_IPCO );
                #else
                    CLEAR_BIT( ulReg, ETH_MACCR_IPCO );
                #endif
                #ifdef ETH_MACCR_CSTF
                    CLEAR_BIT( ulReg, ETH_MACCR_CSTF );
                #endif
                SET_BIT( ulReg, ETH_MACCR_APCS );
                CLEAR_BIT( ulReg, ETH_MACCR_RD );
            #elif defined( niEMAC_STM32HX )
                #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
                    SET_BIT( ulReg, ETH_MACCR_IPC );
                #else
                    CLEAR_BIT( ulReg, ETH_MACCR_IPC );
                #endif
                CLEAR_BIT( ulReg, ETH_MACCR_CST );
                SET_BIT( ulReg, ETH_MACCR_ACS );
                CLEAR_BIT( ulReg, ETH_MACCR_DR );
            #endif
            WRITE_REG( pxEthHandle->Instance->MACCR, ulReg );

            #if defined( niEMAC_STM32FX )
                #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM ) || ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM )
                    SET_BIT( pxEthHandle->Instance->DMABMR, ETH_DMABMR_EDE );
                #else
                    CLEAR_BIT( pxEthHandle->Instance->DMABMR, ETH_DMABMR_EDE );
                #endif
                SET_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_OSF );
            #elif defined( niEMAC_STM32HX )
                SET_BIT( pxEthHandle->Instance->DMACTCR, ETH_DMACTCR_OSP );
                /* #if ipconfigIS_ENABLED( ipconfigUSE_TCP ) && ipconfigIS_ENABLED( niEMAC_TCP_SEGMENTATION )
                    SET_BIT( pxEthHandle->Instance->DMACTCR, ETH_DMACTCR_TSE );
                    MODIFY_REG( pxEthHandle->Instance->DMACCR, ETH_DMACCR_MSS, ipconfigTCP_MSS );
                #endif */
            #endif

            #if defined( niEMAC_STM32HX )
                prvInitPacketFilter( pxEthHandle->Instance, pxInterface );

                /* CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_ARP;
                WRITE_REG( pxEthHandle->Instance->MACARPAR, ulSourceIPAddress );
                SET_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_ARP ); */
            #endif

            prvInitMacAddresses( pxEthHandle->Instance, pxInterface );

            xResult = pdTRUE;
        }
    }

    if( xResult == pdTRUE )
    {
        #if ( niEMAC_CACHEABLE != 0 )
            if( niEMAC_CACHE_ENABLED )
            {
                #if ( niEMAC_MPU != 0 )
                    configASSERT( _FLD2VAL( MPU_CTRL_ENABLE, MPU->CTRL ) != 0 );
                #else
                    configASSERT( pdFALSE );
                #endif
                /* _FLD2VAL( SCB_CCSIDR_LINESIZE, SCB->CCSIDR ) */
            }
        #endif

		#ifdef configPRIO_BITS
            const uint32_t ulPrioBits = configPRIO_BITS;
		#else
            const uint32_t ulPrioBits = __NVIC_PRIO_BITS;
		#endif
		const uint32_t ulPriority = NVIC_GetPriority( ETH_IRQn ) << ( 8U - ulPrioBits );
        if( ulPriority < configMAX_SYSCALL_INTERRUPT_PRIORITY )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: Incorrectly set ETH_IRQn priority\n" ) );
            NVIC_SetPriority( ETH_IRQn, configMAX_SYSCALL_INTERRUPT_PRIORITY >> ( 8U - ulPrioBits ) );
        }
        if( NVIC_GetEnableIRQ( ETH_IRQn ) == 0 )
        {
            FreeRTOS_debug_printf( ( "prvEthConfigInit: ETH_IRQn was not enabled by application\n" ) );
            HAL_NVIC_EnableIRQ( ETH_IRQn );
        }
    }
    else
    {
        #ifdef niEMAC_STM32FX
            configASSERT( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 );
        #elif defined( STM32H5 )
            configASSERT( __HAL_RCC_ETH_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETHTX_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETHRX_IS_CLK_ENABLED() != 0 );
        #elif defined( STM32H7)
            configASSERT( __HAL_RCC_ETH1MAC_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETH1TX_IS_CLK_ENABLED() != 0 );
            configASSERT( __HAL_RCC_ETH1RX_IS_CLK_ENABLED() != 0 );
        #endif
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvInitMacAddresses( ETH_TypeDef * const pxEthInstance, NetworkInterface_t * pxInterface )
{
    #ifdef niEMAC_STM32FX
        uint32_t ulReg = READ_REG( pxEthInstance->MACFFR );
        CLEAR_BIT( ulReg, ETH_MACFFR_RA );
        SET_BIT( ulReg, ETH_MACFFR_HPF );
        CLEAR_BIT( ulReg, ETH_MACFFR_SAF );
        CLEAR_BIT( ulReg, ETH_MACFFR_SAIF );
        CLEAR_BIT( ulReg, ETH_MACFFR_PCF );
        SET_BIT( ulReg, ETH_MACFFR_PCF_BlockAll );
        CLEAR_BIT( ulReg, ETH_MACFFR_BFD );
        CLEAR_BIT( ulReg, ETH_MACFFR_PAM );
        CLEAR_BIT( ulReg, ETH_MACFFR_DAIF );
        SET_BIT( ulReg, ETH_MACFFR_HM );
        SET_BIT( ulReg, ETH_MACFFR_HU );
        CLEAR_BIT( ulReg, ETH_MACFFR_PM );
        WRITE_REG( pxEthInstance->MACFFR, ulReg );
    #elif defined( niEMAC_STM32HX )
        uint32_t ulReg = READ_REG( pxEthInstance->MACPFR );
        CLEAR_BIT( ulReg, ETH_MACPFR_RA );
        CLEAR_BIT( ulReg, ETH_MACPFR_DNTU );
        SET_BIT( ulReg, ETH_MACPFR_HPF );
        CLEAR_BIT( ulReg, ETH_MACPFR_SAF );
        CLEAR_BIT( ulReg, ETH_MACPFR_SAIF );
        MODIFY_REG( ulReg, ETH_MACPFR_PCF, ETH_MACPFR_PCF_BLOCKALL );
        CLEAR_BIT( ulReg, ETH_MACPFR_DBF );
        CLEAR_BIT( ulReg, ETH_MACPFR_PM );
        CLEAR_BIT( ulReg, ETH_MACPFR_DAIF );
        SET_BIT( ulReg, ETH_MACPFR_HMC );
        SET_BIT( ulReg, ETH_MACPFR_HUC );
        CLEAR_BIT( ulReg, ETH_MACPFR_PR );
        WRITE_REG( pxEthInstance->MACPFR, ulReg );
    #endif

    NetworkEndPoint_t * pxEndPoint;
    for( pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
    {
        prvAddAllowedMACAddress( pxInterface, pxEndPoint->xMACAddress.ucBytes );
    }

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
        #if ipconfigIS_ENABLED( ipconfigUSE_MDNS )
            prvAddAllowedMACAddress( xMDNS_MacAddress.ucBytes );
        #endif
        #if ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
            prvAddAllowedMACAddress( xLLMNR_MacAddress.ucBytes );
        #endif
    #endif

    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
        prvAddAllowedMACAddress( pcLOCAL_ALL_NODES_MULTICAST_MAC.ucBytes );
        #if ipconfigIS_ENABLED( ipconfigUSE_MDNS )
            prvAddAllowedMACAddress( xMDNS_MACAddressIPv6.ucBytes );
        #endif
        #if ipconfigIS_ENABLED( ipconfigUSE_LLMNR )
            prvAddAllowedMACAddress( xLLMNR_MacAddressIPv6.ucBytes );
        #endif
    #endif
}

