HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

#ifdef niEMAC_STM32HX

static void prvInitPacketFilter( ETH_TypeDef * const pxEthInstance, const NetworkInterface_t * const pxInterface )
{
    CLEAR_BIT( pxEthInstance->MACPFR, ETH_MACPFR_IPFE );

    #if ipconfigIS_ENABLED( ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM )
    {
        const uint8_t ucFilterCount = _FLD2VAL( ETH_MACHWF1R_L3L4FNUM, pxEthInstance->MACHWF1R );
        if( ucFilterCount > 0 )
        {
            /* "The Layer 3 and Layer 4 Packet Filter feature automatically selects the IPC Full Checksum
             *  Offload Engine on the Receive side. When this feature is enabled, you must set the IPC bit." */
            if( READ_BIT( pxEthInstance->MACCR, ETH_MACCR_IPC ) == 0 )
            {
                SET_BIT( pxEthInstance->MACCR, ETH_MACCR_IPC );
            }

            #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES )
            {
                /* Filter out all possibilities if frame type is disabled */
                #if ipconfigIS_DISABLED( ipconfigUSE_IPv4 )
                {
                    /* Block IPv4 if it is disabled */
                    uint32_t ulReg = READ_REG( pxEthInstance->MACL3L4C0R );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3PEN );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L3SAM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3SAIM );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L3DAM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3DAIM );
                    MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HSBM, 0x1FU );
                    MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HDBM, 0x1FU );
                    MODIFY_REG( pxEthInstance->MACL3A0R0R, ETH_MACL3A0R_L3A0, ipBROADCAST_IP_ADDRESS );
                    MODIFY_REG( pxEthInstance->MACL3A1R0R, ETH_MACL3A1R_L3A1, ipBROADCAST_IP_ADDRESS );
                    WRITE_REG( pxEthInstance->MACL3L4C0R, ulReg );
                }
                #endif /* if ipconfigIS_DISABLED( ipconfigUSE_IPv4 ) */

                #if ipconfigIS_DISABLED( ipconfigUSE_IPv6 )
                {
                    /* Block IPv6 if it is disabled */
                    uint32_t ulReg = READ_REG( pxEthInstance->MACL3L4C1R );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L3PEN );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L3SAM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3SAIM );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L3DAM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3DAIM );
                    MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HSBM, 0x1FU );
                    MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HDBM, 0x1FU );
                    MODIFY_REG( pxEthInstance->MACL3A0R1R, ETH_MACL3A0R_L3A0, ipBROADCAST_IP_ADDRESS );
                    MODIFY_REG( pxEthInstance->MACL3A1R1R, ETH_MACL3A1R_L3A1, ipBROADCAST_IP_ADDRESS );
                    MODIFY_REG( pxEthInstance->MACL3A2R1R, ETH_MACL3A2R_L3A2, ipBROADCAST_IP_ADDRESS );
                    MODIFY_REG( pxEthInstance->MACL3A3R1R, ETH_MACL3A3R_L3A3, ipBROADCAST_IP_ADDRESS );
                    WRITE_REG( pxEthInstance->MACL3L4C1R, ulReg );
                }
                #endif /* if ipconfigIS_DISABLED( ipconfigUSE_IPv6 ) */

                for( NetworkEndPoint_t * pxEndPoint = FreeRTOS_FirstEndPoint( pxInterface ); pxEndPoint != NULL; pxEndPoint = FreeRTOS_NextEndPoint( pxInterface, pxEndPoint ) )
                {
                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv4 )
                        if( ENDPOINT_IS_IPv4( pxEndPoint ) )
                        {
                            uint32_t ulReg = READ_REG( pxEthInstance->MACL3L4C0R );
                            CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3PEN );
                            SET_BIT( ulReg, ETH_MACL3L4CR_L3SAM );
                            CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3SAIM );
                            SET_BIT( ulReg, ETH_MACL3L4CR_L3DAM );
                            CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3DAIM );
                            MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HSBM, 0x1FU );
                            MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HDBM, 0x1FU );
                            MODIFY_REG( pxEthInstance->MACL3A0R0R, ETH_MACL3A0R_L3A0, ipBROADCAST_IP_ADDRESS );
                            MODIFY_REG( pxEthInstance->MACL3A1R0R, ETH_MACL3A1R_L3A1, pxEndPoint->ipv4_settings.ulIPAddress );
                            WRITE_REG( pxEthInstance->MACL3L4C0R, ulReg );
                        }
                    #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv4 ) */
                    #if ipconfigIS_ENABLED( ipconfigUSE_IPv6 )
                        if( ENDPOINT_IS_IPv6( pxEndPoint ) )
                        {
                            uint32_t ulReg = READ_REG( pxEthInstance->MACL3L4C1R );
                            SET_BIT( ulReg, ETH_MACL3L4CR_L3PEN );
                            SET_BIT( ulReg, ETH_MACL3L4CR_L3SAM );
                            CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3SAIM );
                            SET_BIT( ulReg, ETH_MACL3L4CR_L3DAM );
                            CLEAR_BIT( ulReg, ETH_MACL3L4CR_L3DAIM );
                            MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HSBM, 0x1FU );
                            MODIFY_REG( ulReg, ETH_MACL3L4CR_L3HDBM, 0x1FU );
                            MODIFY_REG( pxEthInstance->MACL3A0R1R, ETH_MACL3A0R_L3A0, ipBROADCAST_IP_ADDRESS );
                            MODIFY_REG( pxEthInstance->MACL3A1R1R, ETH_MACL3A1R_L3A1, ipBROADCAST_IP_ADDRESS );
                            MODIFY_REG( pxEthInstance->MACL3A2R1R, ETH_MACL3A2R_L3A2, ipBROADCAST_IP_ADDRESS );
                            MODIFY_REG( pxEthInstance->MACL3A3R1R, ETH_MACL3A3R_L3A3, ipBROADCAST_IP_ADDRESS );
                            WRITE_REG( pxEthInstance->MACL3L4C1R, ulReg );
                        }
                    #endif /* if ipconfigIS_ENABLED( ipconfigUSE_IPv6 ) */
                }
            }
            #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES ) */

            #if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS )
            {
                /* TODO: Let user to block certain port numbers */
                /* TODO: Live updated in task based on active sockets? */

                /* Always allow all UDP */
                uint32_t ulReg = READ_REG( pxEthInstance->MACL4A0R );
                SET_BIT( ulReg, ETH_MACL3L4CR_L4PEN );
                CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4SPM );
                CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4SPIM );
                CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4DPM );
                CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4DPIM );
                MODIFY_REG( ulReg, ETH_MACL4AR_L4DP, 0U );
                MODIFY_REG( ulReg, ETH_MACL4AR_L4SP, 0U );
                WRITE_REG( pxEthInstance->MACL4A0R, ulReg );

                #if ipconfigIS_DISABLED( ipconfigUSE_TCP )
                    /* Block TCP if it is disabled */
                    uint32_t ulReg = READ_REG( pxEthInstance->MACL4A1R );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4PEN );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L4SPM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4SPIM );
                    SET_BIT( ulReg, ETH_MACL3L4CR_L4DPM );
                    CLEAR_BIT( ulReg, ETH_MACL3L4CR_L4DPIM );
                    MODIFY_REG( ulReg, ETH_MACL4AR_L4DP, 0xFFFFU );
                    MODIFY_REG( ulReg, ETH_MACL4AR_L4SP, 0xFFFFU );
                    WRITE_REG( pxEthInstance->MACL4A1R, ulReg );
                #endif /* if ipconfigIS_DISABLED( ipconfigUSE_TCP ) */
            }
            #endif /* if ipconfigIS_ENABLED( ipconfigETHERNET_DRIVER_FILTERS_PACKETS ) */

