HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
			/* TODO: Create a eConsiderPacketForProcessing */
            if( eConsiderPacketForProcessing( pxDescriptor->pucEthernetBuffer ) != eProcessBuffer )
            {
            	iptraceETHERNET_RX_EVENT_LOST();
                FreeRTOS_debug_printf( ( "prvAcceptPacket: Packet discarded\n" ) );
                break;
            }
        #endif

        xResult = pdTRUE;

    } while( pdFALSE );

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                              IRQ Handlers                                 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void ETH_IRQHandler( void )
{
    traceISR_ENTER();

    ETH_HandleTypeDef * pxEthHandle = &xEthHandle;

    xSwitchRequired = pdFALSE;

    #ifdef niEMAC_STM32FX
    	if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_NIS ) )
		{
            if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_NISE ) )
            {
    			if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_RS ) )
    			{
    				if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_RIE ) )
    				{
    					__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_RS );
    					HAL_ETH_RxCpltCallback( pxEthHandle );
    				}
    			}

    			if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_TS ) )
    			{
    				if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_TIE ) )
    				{
    					__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_TS );
    					HAL_ETH_TxCpltCallback( pxEthHandle );
    				}
    			}

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_ERS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_ERIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_ERS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_TBUS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_TBUIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_TBUS );
                    }
                }

    			__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_NIS );
            }
		}

    	if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_AIS ) )
		{
			if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_AISE ) )
			{
				if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_FBES ) )
				{
					if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_FBEIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_FBES );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_TPS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_TPSIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_TPS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_RPS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_RPSIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_RPS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_RBUS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_RBUIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_RBUS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_TUS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_TUIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_TUS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_RWTS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_RWTIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_RWTS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_ETS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_ETIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_ETS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_ROS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_ROIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_ROS );
                    }
                }

                if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMASR_TJTS ) )
                {
                    if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMAIER_TJTIE ) )
                    {
                        __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_TJTS );
                    }
                }

				__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMASR_AIS );
			}
		}
    #elif defined( niEMAC_STM32HX )
        if( READ_BIT( pxEthHandle->Instance->DMAISR, ETH_DMAISR_MTLIS ) != 0 )
        {

        }

        if( READ_BIT( pxEthHandle->Instance->DMAISR, ETH_DMAISR_DMACIS ) != 0 )
        {
            /* ETH_DMACSR_REB */
            /* ETH_DMACSR_TEB */
            if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_NIS ) )
            {
                if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_NIE ) )
                {
                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_RI ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_RIE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_RI );
                            HAL_ETH_RxCpltCallback( pxEthHandle );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_TI ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_TIE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_TI );
                            HAL_ETH_TxCpltCallback( pxEthHandle );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_ERI ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_ERIE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_ERI );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_TBU ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_TBUE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_TBU );
                        }
                    }

                    __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_NIS );
                }
            }

            if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_AIS ) )
            {
                if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_AIE ) )
                {
                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_FBE ) )
                    {
                    	if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_FBEE ) )
						{
							__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_FBE );
							/* prvHAL_MAC_ErrorCallback( pxEthHandle ); */
						}
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_RWT ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_RWTE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_RWT );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_ETI ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_ETIE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_ETI );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_TPS ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_TXSE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_TPS );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_RPS ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_RSE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_RPS );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_RBU ) )
                    {
                        if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_RBUE ) )
                        {
                            __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_RBU );
                        }
                    }

                    if( __HAL_ETH_DMA_GET_IT( pxEthHandle, ETH_DMACSR_CDE ) )
					{
						if( __HAL_ETH_DMA_GET_IT_SOURCE( pxEthHandle, ETH_DMACIER_CDEE ) )
						{
							__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_CDE );
						}
					}

