HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
                    __HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_DMACSR_AIS );
                }
            }
        }

        if( ( pxEthHandle->Instance->DMAISR & ETH_DMAISR_MACIS ) != 0 )
        {
            if( __HAL_ETH_MAC_GET_IT( pxEthHandle, ETH_MACISR_RXSTSIS ) )
            {
                if( READ_BIT( pxEthHandle->Instance->MACIER, ETH_MACIER_RXSTSIE ) != 0 )
                {
                	__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_MACISR_RXSTSIS );
                    /* prvHAL_MAC_ErrorCallback( pxEthHandle ); */
                }
            }

            if( __HAL_ETH_MAC_GET_IT( pxEthHandle, ETH_MACISR_TXSTSIS ) )
            {
                if( READ_BIT( pxEthHandle->Instance->MACIER, ETH_MACIER_TXSTSIE ) != 0 )
                {
                	__HAL_ETH_DMA_CLEAR_IT( pxEthHandle, ETH_MACISR_TXSTSIS );
                    /* prvHAL_MAC_ErrorCallback( pxEthHandle ); */
                }
            }

            #if ipconfigIS_ENABLED( niEMAC_USE_PHY_INT )
                if( __HAL_ETH_MAC_GET_IT( pxEthHandle, ETH_MACISR_PHYIS ) )
                {
                    if( READ_BIT( pxEthHandle->Instance->MACIER, ETH_MACIER_PHYIE ) != 0 )
                    {
                        if( xLan8742aObject.Is_Initialized != 0 )
                        {
                            if( LAN8742_GetITStatus( &xLan8742aObject, LAN8742_LINK_DOWN_IT ) )
                            {
                                LAN8742_ClearIT( &xLan8742aObject, LAN8742_LINK_DOWN_IT );
                            }
                        }
                        if( xDp83848Object.Is_Initialized != 0 )
                        {
                            if( DP83848_GetITStatus( &xDp83848Object, DP83848_LINK_DOWN_IT ) )
                            {
                                DP83848_ClearIT( &xDp83848Object, DP83848_LINK_DOWN_IT );
                            }
                        }
                    }
                }
            #endif /* if defined( niEMAC_STM32HX ) && ipconfigIS_ENABLED( niEMAC_USE_PHY_INT ) */
        }
    #endif

    portYIELD_FROM_ISR( xSwitchRequired );
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
    eMAC_IF_EVENT eErrorEvents = eMacEventNone;

    if( pxEthHandle->gState == HAL_ETH_STATE_ERROR )
    {
        /* Fatal bus error occurred */
        eErrorEvents |= eMacEventErrEth;
    }

    if( ( pxEthHandle->ErrorCode & HAL_ETH_ERROR_DMA ) != 0 )
    {
        eErrorEvents |= eMacEventErrDma;
        const uint32_t ulDmaError = pxEthHandle->DMAErrorCode;
		#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )
        	prvHAL_DMA_ErrorCallback( pxEthHandle );
		#endif
		if( ( ulDmaError & ETH_DMA_TX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
		{
			eErrorEvents |= eMacEventErrTx;
		}

		if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
		{
			eErrorEvents |= eMacEventErrRx;
		}
    }

    if( ( pxEthHandle->ErrorCode & HAL_ETH_ERROR_MAC ) != 0 )
    {
        eErrorEvents |= eMacEventErrMac;
		#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )
        	prvHAL_MAC_ErrorCallback( pxEthHandle );
		#endif
    }

    if( ( xEMACTaskHandle != NULL ) && ( eErrorEvents != eMacEventNone ) )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eErrorEvents, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostRXDescsUsed = 0U;

    const size_t uxRxUsed = pxEthHandle->RxDescList.RxDescCnt;

    if( uxMostRXDescsUsed < uxRxUsed )
    {
        uxMostRXDescsUsed = uxRxUsed;
    }

    iptraceNETWORK_INTERFACE_RECEIVE();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventRx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_TxCpltCallback( ETH_HandleTypeDef * pxEthHandle )
{
    static size_t uxMostTXDescsUsed = 0U;

    const size_t uxTxUsed = pxEthHandle->TxDescList.BuffersInUse;

    if( uxMostTXDescsUsed < uxTxUsed )
    {
        uxMostTXDescsUsed = uxTxUsed;
    }

    iptraceNETWORK_INTERFACE_TRANSMIT();

    if( xEMACTaskHandle != NULL )
    {
        BaseType_t xHigherPriorityTaskWoken = pdFALSE;
        ( void ) xTaskNotifyFromISR( xEMACTaskHandle, eMacEventTx, eSetBits, &xHigherPriorityTaskWoken );
        xSwitchRequired |= xHigherPriorityTaskWoken;
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                            HAL Tx/Rx Callbacks                            */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void HAL_ETH_RxAllocateCallback( uint8_t ** ppucBuff )
{
    const NetworkBufferDescriptor_t * pxBufferDescriptor = pxGetNetworkBufferWithDescriptor( niEMAC_DATA_BUFFER_SIZE, pdMS_TO_TICKS( niEMAC_DESCRIPTOR_WAIT_TIME_MS ) );
    if( pxBufferDescriptor != NULL )
    {
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_MAINTENANCE )
            {
                SCB_InvalidateDCache_by_Addr( ( uint32_t * ) pxBufferDescriptor->pucEthernetBuffer, pxBufferDescriptor->xDataLength );
            }
        #endif
        *ppucBuff = pxBufferDescriptor->pucEthernetBuffer;
    }
    else
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxAllocateCallback: failed\n" ) );
    }
}

/*---------------------------------------------------------------------------*/

void HAL_ETH_RxLinkCallback( void ** ppvStart, void ** ppvEnd, uint8_t * pucBuff, uint16_t usLength )
{
    NetworkBufferDescriptor_t ** const ppxStartDescriptor = ( NetworkBufferDescriptor_t ** ) ppvStart;
    NetworkBufferDescriptor_t ** const ppxEndDescriptor = ( NetworkBufferDescriptor_t ** ) ppvEnd;
    NetworkBufferDescriptor_t * const pxCurDescriptor = pxPacketBuffer_to_NetworkBuffer( ( const void * ) pucBuff );
    if( prvAcceptPacket( pxCurDescriptor, usLength ) == pdTRUE )
    {
        pxCurDescriptor->xDataLength = usLength;
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            pxCurDescriptor->pxNextBuffer = NULL;
        #endif
        if( *ppxStartDescriptor == NULL )
        {
            *ppxStartDescriptor = pxCurDescriptor;
        }
        #if ipconfigIS_ENABLED( ipconfigUSE_LINKED_RX_MESSAGES )
            else if( ppxEndDescriptor != NULL )
            {
                ( *ppxEndDescriptor )->pxNextBuffer = pxCurDescriptor;
            }
        #endif
        *ppxEndDescriptor = pxCurDescriptor;
        /* Only single buffer packets are supported */
        configASSERT( *ppxStartDescriptor == *ppxEndDescriptor );
        #ifdef niEMAC_CACHEABLE
            if( niEMAC_CACHE_MAINTENANCE )
            {
                SCB_InvalidateDCache_by_Addr( ( uint32_t * ) pucBuff, usLength );
            }
        #endif
    }
    else
    {
        FreeRTOS_debug_printf( ( "HAL_ETH_RxLinkCallback: Buffer Dropped\n" ) );
        prvReleaseNetworkBufferDescriptor( pxCurDescriptor );
    }
}

