HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
/*---------------------------------------------------------------------------*/

void HAL_ETH_TxFreeCallback( uint32_t * pulBuff )
{
    NetworkBufferDescriptor_t * const pxNetworkBuffer = ( NetworkBufferDescriptor_t * ) pulBuff;
    prvReleaseNetworkBufferDescriptor( pxNetworkBuffer );
    ( void ) xSemaphoreGive( xTxDescSem );
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                           Buffer Allocation                               */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    static uint8_t ucNetworkPackets[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ niEMAC_TOTAL_BUFFER_SIZE ] __ALIGNED( niEMAC_BUF_ALIGNMENT ) __attribute__( ( section( niEMAC_BUFFERS_SECTION ) ) );

    configASSERT( xBufferAllocFixedSize == pdTRUE );

    size_t uxIndex;
    for( uxIndex = 0; uxIndex < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; ++uxIndex )
    {
        pxNetworkBuffers[ uxIndex ].pucEthernetBuffer = &( ucNetworkPackets[ uxIndex ][ ipBUFFER_PADDING ] );
        *( ( uint32_t * ) &( ucNetworkPackets[ uxIndex ][ 0 ] ) ) = ( uint32_t ) ( &( pxNetworkBuffers[ uxIndex ] ) );
    }
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      Network Interface Definition                         */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

NetworkInterface_t * pxSTM32_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface )
{
    static char pcName[ 17 ];

    ( void ) snprintf( pcName, sizeof( pcName ), "eth%u", ( unsigned ) xEMACIndex );

    ( void ) memset( pxInterface, '\0', sizeof( *pxInterface ) );
    pxInterface->pcName = pcName;
    /* TODO: use pvArgument to get xEMACData? */
    /* xEMACData.xEMACIndex = xEMACIndex; */
    /* pxInterface->pvArgument = ( void * ) &xEMACData; */
    /* pxInterface->pvArgument = pvPortMalloc( sizeof( EMACData_t ) ); */
    pxInterface->pvArgument = ( void * ) xEMACIndex;
    pxInterface->pfInitialise = prvNetworkInterfaceInitialise;
    pxInterface->pfOutput = prvNetworkInterfaceOutput;
    pxInterface->pfGetPhyLinkStatus = prvGetPhyLinkStatus;
    /* pxInterface->pfAddAllowedMAC = prvAddAllowedMACAddress;
    pxInterface->pfRemoveAllowedMAC = prvRemoveAllowedMACAddress; */

    return FreeRTOS_AddNetworkInterface( pxInterface );
}

/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( ipconfigIPv4_BACKWARD_COMPATIBLE )

/* Do not call the following function directly. It is there for downward compatibility.
 * The function FreeRTOS_IPInit() will call it to initialice the interface and end-point
 * objects.  See the description in FreeRTOS_Routing.h. */
    NetworkInterface_t * pxFillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t * pxInterface )
    {
        pxSTM32_FillInterfaceDescriptor( xEMACIndex, pxInterface );
    }

#endif

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                        Reimplemented HAL Functions                        */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_Stop_IT( ETH_HandleTypeDef * const pxEthHandle )
{
    BaseType_t xResult = pdFAIL;

    if( pxEthHandle->gState == HAL_ETH_STATE_STARTED )
    {
        pxEthHandle->gState = HAL_ETH_STATE_BUSY;

        #ifdef niEMAC_STM32FX
            __HAL_ETH_DMA_DISABLE_IT( pxEthHandle, 
                ( ETH_DMAIER_NISE | ETH_DMAIER_RIE | ETH_DMAIER_TIE | ETH_DMAIER_FBEIE | ETH_DMAIER_AISE | ETH_DMAIER_RBUIE )
            );
            CLEAR_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_ST );
            CLEAR_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_SR );
            CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_RE );
            SET_BIT( pxEthHandle->Instance->DMAOMR, ETH_DMAOMR_FTF );
            CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_TE );
        #elif defined( niEMAC_STM32HX )
            __HAL_ETH_DMA_DISABLE_IT( pxEthHandle,
                ( ETH_DMACIER_NIE | ETH_DMACIER_RIE | ETH_DMACIER_TIE | ETH_DMACIER_FBEE | ETH_DMACIER_AIE | ETH_DMACIER_RBUE )
            );
            CLEAR_BIT( pxEthHandle->Instance->DMACTCR, ETH_DMACTCR_ST );
            CLEAR_BIT( pxEthHandle->Instance->DMACRCR, ETH_DMACRCR_SR );
            CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_RE );
            SET_BIT( pxEthHandle->Instance->MTLTQOMR, ETH_MTLTQOMR_FTQ );
            CLEAR_BIT( pxEthHandle->Instance->MACCR, ETH_MACCR_TE );
        #endif

        uint8_t descindex;
        for( descindex = 0; descindex < ETH_RX_DESC_CNT; ++descindex )
        {
            ETH_DMADescTypeDef * const dmarxdesc = ( ETH_DMADescTypeDef * const ) pxEthHandle->RxDescList.RxDesc[ descindex ];
            #ifdef niEMAC_STM32FX
                dmarxdesc->DESC1 |= ETH_DMARXDESC_DIC;
            #elif defined( niEMAC_STM32HX )
                dmarxdesc->DESC3 &= ~ETH_DMARXNDESCRF_IOC;
            #endif
        }

        pxEthHandle->RxDescList.ItMode = 0U;

        pxEthHandle->gState = HAL_ETH_STATE_READY;

        xResult = pdPASS;
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_SetMDIOClockRange( ETH_TypeDef * const pxEthInstance )
{
    const uint32_t ulHClk = HAL_RCC_GetHCLKFreq();

