HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
    if( ( ulHClk >= 20000000U ) && ( ulHClk < 35000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div16 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV16 );
        #endif
    }
    else if( ( ulHClk >= 35000000U ) && ( ulHClk < 60000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div26 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV26 );
        #endif
    }
    else if( ( ulHClk >= 60000000U ) && ( ulHClk < 100000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div42 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV42 );
        #endif
    }
    else if( ( ulHClk >= 100000000U ) && ( ulHClk < 150000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div62 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV62 );
        #endif
    }
    else if(  ( ulHClk >= 150000000U ) && ( ulHClk <= 250000000U ) )
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( pxEthInstance->MACMIIAR, ETH_MACMIIAR_CR, ETH_MACMIIAR_CR_Div102 );
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV102 );
        #endif
    }
    else
    {
        #ifdef niEMAC_STM32HX
            MODIFY_REG( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_CR, ETH_MACMDIOAR_CR_DIV124 );
        #endif
    }
}

/*---------------------------------------------------------------------------*/

static void prvHAL_ETH_SetHashTable( ETH_TypeDef * const pxEthInstance )
{
    #ifdef niEMAC_STM32FX
        WRITE_REG( pxEthInstance->MACHTHR, ulHashTable[ 0 ] );
        WRITE_REG( pxEthInstance->MACHTLR, ulHashTable[ 1 ] );
    #elif defined( niEMAC_STM32HX )
        WRITE_REG( pxEthInstance->MACHT0R, ulHashTable[ 0 ] );
        WRITE_REG( pxEthInstance->MACHT1R, ulHashTable[ 1 ] );
    #endif
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_ReadPHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t * pulRegValue )
{
    BaseType_t xResult = pdPASS;

    #ifdef niEMAC_STM32FX
        uint32_t ulReg = READ_REG( pxEthInstance->MACMIIAR );
    #elif defined( niEMAC_STM32HX )
        uint32_t ulReg = READ_REG( pxEthInstance->MACMDIOAR );
    #endif

    #ifdef niEMAC_STM32FX
        if( READ_BIT( ulReg, ETH_MACMIIAR_MB ) != 0 )
    #elif defined( niEMAC_STM32HX )
        if( READ_BIT( ulReg, ETH_MACMDIOAR_MB ) != 0 )
    #endif
    {
        xResult = pdFAIL;
    }
    else
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( ulReg, ETH_MACMIIAR_PA, _VAL2FLD( ETH_MACMIIAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMIIAR_MR, _VAL2FLD( ETH_MACMIIAR_MR, ulPhyReg ) );
            CLEAR_BIT( ulReg, ETH_MACMIIAR_MW );
            SET_BIT( ulReg, ETH_MACMIIAR_MB );
            WRITE_REG( pxEthInstance->MACMIIAR, ulReg);
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( ulReg, ETH_MACMDIOAR_PA, _VAL2FLD( ETH_MACMDIOAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_RDA, _VAL2FLD( ETH_MACMDIOAR_RDA, ulPhyReg ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_MOC, ETH_MACMDIOAR_MOC_WR );
            SET_BIT( ulReg, ETH_MACMDIOAR_MB);
            WRITE_REG( pxEthInstance->MACMDIOAR, ulReg );
        #endif

        TimeOut_t xPhyWriteTimer;
        vTaskSetTimeOutState( &xPhyWriteTimer );
        TickType_t xPhyWriteRemaining = pdMS_TO_TICKS( 2U );
        #ifdef niEMAC_STM32FX
            while( READ_BIT( pxEthInstance->MACMIIAR, ETH_MACMIIAR_MB ) != 0 )
        #elif defined( niEMAC_STM32HX )
            while( READ_BIT( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_MB ) != 0 )
        #endif
        {
            if( xTaskCheckForTimeOut( &xPhyWriteTimer, &xPhyWriteRemaining ) != pdFALSE )
            {
                xResult = pdFAIL;
                break;
            }
            else
            {
                vTaskDelay( pdMS_TO_TICKS( 1 ) );
            }
        }

        #ifdef niEMAC_STM32FX
            WRITE_REG( *pulRegValue, _FLD2VAL( ETH_MACMIIDR_MD, pxEthInstance->MACMIIDR ) );
        #elif defined( niEMAC_STM32HX )
            WRITE_REG( *pulRegValue, _FLD2VAL( ETH_MACMDIODR_MD, pxEthInstance->MACMDIODR ) );
        #endif
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/

static BaseType_t prvHAL_ETH_WritePHYRegister( ETH_TypeDef * const pxEthInstance, uint32_t ulPhyAddr, uint32_t ulPhyReg, uint32_t ulRegValue )
{
    BaseType_t xResult = pdPASS;

    #ifdef niEMAC_STM32FX
        uint32_t ulReg = READ_REG( pxEthInstance->MACMIIAR );
    #elif defined( niEMAC_STM32HX )
        uint32_t ulReg = READ_REG( pxEthInstance->MACMDIOAR );
    #endif

    #ifdef niEMAC_STM32FX
        if( READ_BIT( ulReg, ETH_MACMIIAR_MB ) != 0 )
    #elif defined( niEMAC_STM32HX )
        if( READ_BIT( ulReg, ETH_MACMDIOAR_MB ) != 0 )
    #endif
    {
        xResult = pdFAIL;
    }
    else
    {
        #ifdef niEMAC_STM32FX
            MODIFY_REG( ulReg, ETH_MACMIIAR_PA, _VAL2FLD( ETH_MACMIIAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMIIAR_MR, _VAL2FLD( ETH_MACMIIAR_MR, ulPhyReg ) );
            SET_BIT( ulReg, ETH_MACMIIAR_MW );
            SET_BIT( ulReg, ETH_MACMIIAR_MB );
            WRITE_REG( pxEthInstance->MACMIIDR, _VAL2FLD( ETH_MACMIIDR_MD, ulRegValue ) );
            WRITE_REG( pxEthInstance->MACMIIAR, ulReg);
        #elif defined( niEMAC_STM32HX )
            MODIFY_REG( ulReg, ETH_MACMDIOAR_PA, _VAL2FLD( ETH_MACMDIOAR_PA, ulPhyAddr ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_RDA, _VAL2FLD( ETH_MACMDIOAR_RDA, ulPhyReg ) );
            MODIFY_REG( ulReg, ETH_MACMDIOAR_MOC, ETH_MACMDIOAR_MOC_WR );
            SET_BIT( ulReg, ETH_MACMDIOAR_MB);
            WRITE_REG( pxEthInstance->MACMDIODR, _VAL2FLD( ETH_MACMDIODR_MD, ulRegValue ) );
            WRITE_REG( pxEthInstance->MACMDIOAR, ulReg );
        #endif

