HTRamsey/STM32_ETH_Test/Libs/FreeRTOS-Plus-TCP/portable/NetworkInterface.c
        TimeOut_t xPhyWriteTimer;
        vTaskSetTimeOutState( &xPhyWriteTimer );
        TickType_t xPhyWriteRemaining = pdMS_TO_TICKS( 2U );
        #ifdef niEMAC_STM32FX
            while( READ_BIT( pxEthInstance->MACMIIAR, ETH_MACMIIAR_MB ) != 0 )
        #elif defined( niEMAC_STM32HX )
            while( READ_BIT( pxEthInstance->MACMDIOAR, ETH_MACMDIOAR_MB ) != 0 )
        #endif
        {
            if( xTaskCheckForTimeOut( &xPhyWriteTimer, &xPhyWriteRemaining ) != pdFALSE )
            {
                xResult = pdFAIL;
                break;
            }
            else
            {
                vTaskDelay( pdMS_TO_TICKS( 1 ) );
            }
        }
    }

    return xResult;
}

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                      		Debugging                         			 */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

#if ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR )

static void prvHAL_RX_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
	uint32_t ulErrorCode = 0;
	( void ) HAL_ETH_GetRxDataErrorCode( pxEthHandle, &ulErrorCode );
    if( ( pxEthHandle->Init.MediaInterface == HAL_ETH_MII_MODE ) && ( ( ulErrorCode & ETH_DRIBBLE_BIT_ERROR ) != 0 ) )
    {
    	static size_t uxRxDBError = 0;
    	++uxRxDBError;
    }
    if( ( ulErrorCode & ETH_RECEIVE_ERROR ) != 0 )
    {
    	static size_t uxRxRcvError = 0;
		++uxRxRcvError;
    }
    if( ( ulErrorCode & ETH_RECEIVE_OVERFLOW ) != 0 )
    {
    	static size_t uxRxROError = 0;
		++uxRxROError;
    }
    if( ( ulErrorCode & ETH_WATCHDOG_TIMEOUT ) != 0 )
    {
    	static size_t uxRxWDTError = 0;
		++uxRxWDTError;
    }
    if( ( ulErrorCode & ETH_GIANT_PACKET ) != 0 )
    {
    	static size_t uxRxGPError = 0;
		++uxRxGPError;
    }
    if( ( ulErrorCode & ETH_CRC_ERROR ) != 0 )
    {
    	static size_t uxRxCRCError = 0;
		++uxRxCRCError;
    }
}

/*---------------------------------------------------------------------------*/

static void prvHAL_DMA_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
	#ifdef niEMAC_STM32HX
	{
		const uint32_t ulDmaError = pxEthHandle->DMAErrorCode;
		if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) != ETH_DMA_RX_NO_ERROR_FLAG )
		{
			/* if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_DESC_READ_ERROR_FLAG )
			{
				static size_t uxDmaRDRError = 0;
				++uxDmaRDRError;
			}
			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_DESC_WRITE_ERROR_FLAG )
			{
				static size_t uxDmaRDWError = 0;
				++uxDmaRDWError;
			}
			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_BUFFER_READ_ERROR_FLAG )
			{
				static size_t uxDmaRBRError = 0;
				++uxDmaRBRError;
			}
			else if( ( ulDmaError & ETH_DMA_RX_ERRORS_MASK ) == ETH_DMA_RX_BUFFER_WRITE_ERROR_FLAG )
			{
				static size_t uxDmaRBWError = 0;
				++uxDmaRBWError;
			} */
		}
		if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) != ETH_DMA_TX_NO_ERROR_FLAG )
		{
			/* if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_DESC_READ_ERROR_FLAG )
			{
				static size_t uxDmaTDRError = 0;
				++uxDmaTDRError;
			}
			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_DESC_WRITE_ERROR_FLAG )
			{
				static size_t uxDmaTDWError = 0;
				++uxDmaTDWError;
			}
			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_BUFFER_READ_ERROR_FLAG )
			{
				static size_t uxDmaTBRError = 0;
				++uxDmaTBRError;
			}
			else if( ( ulDmaError & ETH_DMA_TX_ERRORS_MASK ) == ETH_DMA_TX_BUFFER_WRITE_ERROR_FLAG )
			{
				static size_t uxDmaTBWError = 0;
				++uxDmaTBWError;
			} */
		}
		if( ( ulDmaError & ETH_DMA_CONTEXT_DESC_ERROR_FLAG ) != 0 )
		{
			static size_t uxDmaCDError = 0;
			++uxDmaCDError;
		}
		if( ( ulDmaError & ETH_DMA_FATAL_BUS_ERROR_FLAG ) != 0 )
		{
			static size_t uxDmaFBEError = 0;
			++uxDmaFBEError;
		}
		if( ( ulDmaError & ETH_DMA_EARLY_TX_IT_FLAG ) != 0 )
		{
			static size_t uxDmaETIError = 0;
			++uxDmaETIError;
		}
		if( ( ulDmaError & ETH_DMA_RX_WATCHDOG_TIMEOUT_FLAG ) != 0 )
		{
			static size_t uxDmaRWTError = 0;
			++uxDmaRWTError;
		}
		if( ( ulDmaError & ETH_DMA_RX_PROCESS_STOPPED_FLAG ) != 0 )
		{
			static size_t uxDmaRPSError = 0;
			++uxDmaRPSError;
		}
		if( ( ulDmaError & ETH_DMA_RX_BUFFER_UNAVAILABLE_FLAG ) != 0 )
		{
			static size_t uxDmaRBUError = 0;
			++uxDmaRBUError;
		}
		if( ( ulDmaError & ETH_DMA_TX_PROCESS_STOPPED_FLAG ) != 0 )
		{
			static size_t uxDmaTPSError = 0;
			++uxDmaTPSError;
		}
	}
	#endif /* ifdef niEMAC_STM32HX */
}

/*---------------------------------------------------------------------------*/

static void prvHAL_MAC_ErrorCallback( ETH_HandleTypeDef * pxEthHandle )
{
	#ifdef niEMAC_STM32HX
	{
		const uint32_t ulMacError = pxEthHandle->MACErrorCode;
		if( ( ulMacError & ETH_RECEIVE_WATCHDOG_TIMEOUT ) != 0 )
		{
			static size_t uxMacRWTError = 0;
			++uxMacRWTError;
		}
		if( ( ulMacError & ETH_EXECESSIVE_COLLISIONS ) != 0 )
		{
			static size_t uxMacECError = 0;
			++uxMacECError;
		}
		if( ( ulMacError & ETH_LATE_COLLISIONS ) != 0 )
		{
			static size_t uxMacLCError = 0;
			++uxMacLCError;
		}
		if( ( ulMacError & ETH_EXECESSIVE_DEFERRAL ) != 0 )
		{
			static size_t uxMacEDError = 0;
			++uxMacEDError;
		}
		if( ( ulMacError & ETH_LOSS_OF_CARRIER ) != 0 )
		{
			static size_t uxMacLOCError = 0;
			++uxMacLOCError;
		}
		if( ( ulMacError & ETH_NO_CARRIER ) != 0 )
		{
			static size_t uxMacNCError = 0;
			++uxMacNCError;
		}
		if( ( ulMacError & ETH_TRANSMIT_JABBR_TIMEOUT ) != 0 )
		{
			static size_t uxMacTJTError = 0;
			++uxMacTJTError;
		}
	}
	#endif /* ifdef niEMAC_STM32HX */
}

#endif /* ipconfigIS_ENABLED( niEMAC_DEBUG_ERROR ) */

/*---------------------------------------------------------------------------*/
/*===========================================================================*/
/*                          Sample HAL User Functions                        */
/*===========================================================================*/
/*---------------------------------------------------------------------------*/

